In [1]:
import numpy as np
import pandas as pd

In [10]:
stuff={
    'Corporations': ['Apple','Google', 'Meta', 'Apple', 'Google', 'Meta'],
    'Employees': ['John', 'Jane', 'Jim', 'Jack', 'Jill', 'Joe'],
    'Salary': [100, 200, 300, 400, 500, 600],
}
my_df=pd.DataFrame(stuff)

In [11]:
my_df

  Corporations Employees  Salary
0        Apple      John     100
1       Google      Jane     200
2         Meta       Jim     300
3        Apple      Jack     400
4       Google      Jill     500
5         Meta       Joe     600

In [12]:
# Group by Corporations- To get object location in memory
company=my_df.groupby('Corporations')

In [ ]:
# for sum
company['Salary'].sum()

Corporations
Apple     500
Google    700
Meta      900
Name: Salary, dtype: int64

In [15]:
# Mean
company['Salary'].mean()

Corporations
Apple     250.0
Google    350.0
Meta      450.0
Name: Salary, dtype: float64

In [16]:
# MIN AND MAX
company['Salary'].min(), company['Salary'].max()

(Corporations
 Apple     100
 Google    200
 Meta      300
 Name: Salary, dtype: int64,
 Corporations
 Apple     400
 Google    500
 Meta      600
 Name: Salary, dtype: int64)

In [17]:
# standard deviation
company['Salary'].std()

Corporations
Apple     212.132034
Google    212.132034
Meta      212.132034
Name: Salary, dtype: float64

In [20]:
# var
company.Salary.var()

Corporations
Apple     45000.0
Google    45000.0
Meta      45000.0
Name: Salary, dtype: float64

In [21]:
# count
company['Salary'].count()

Corporations
Apple     2
Google    2
Meta      2
Name: Salary, dtype: int64

In [23]:
# describe
company.describe()

             Salary
              count   mean         std    min    25%    50%    75%    max
Corporations
Apple           2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
Google          2.0  350.0  212.132034  200.0  275.0  350.0  425.0  500.0
Meta            2.0  450.0  212.132034  300.0  375.0  450.0  525.0  600.0